astronautix/X-CubeSat_ODB/sat/sys/stm32f4/inc/safe_stm32f4xx.h

#ifndef _QB50_SYS_STM32F4XX_H
#define _QB50_SYS_STM32F4XX_H

#include <stm32f4xx.h>


#undef TIM1
#undef TIM2
#undef TIM3
#undef TIM4
#undef TIM5
#undef TIM6
#undef TIM7
#undef TIM8
#undef TIM12
#undef TIM13
#undef TIM14
#undef TIM9
#undef TIM10
#undef TIM11
#undef RTC
#undef WWDG
#undef IWDG
#undef I2S2ext
#undef SPI1
#undef SPI2
#undef SPI3
#undef I2S3ext
#undef USART1
#undef USART2
#undef USART3
#undef UART4
#undef UART5
#undef USART6
#undef I2C1
#undef I2C2
#undef I2C3
#undef CAN1
#undef CAN2
#undef PWR
#undef DAC
#undef ADC
#undef ADC1
#undef ADC2
#undef ADC3
#undef SDIO
#undef SYSCFG
#undef NVIC
#undef EXTI
#undef GPIOA
#undef GPIOB
#undef GPIOC
#undef GPIOD
#undef GPIOE
#undef GPIOF
#undef GPIOG
#undef GPIOH
#undef GPIOI
#undef CRC
#undef RCC
#undef FLASH
#undef DMA1
#undef DMA1_Stream0
#undef DMA1_Stream1
#undef DMA1_Stream2
#undef DMA1_Stream3
#undef DMA1_Stream4
#undef DMA1_Stream5
#undef DMA1_Stream6
#undef DMA1_Stream7
#undef DMA2
#undef DMA2_Stream0
#undef DMA2_Stream1
#undef DMA2_Stream2
#undef DMA2_Stream3
#undef DMA2_Stream4
#undef DMA2_Stream5
#undef DMA2_Stream6
#undef DMA2_Stream7
#undef ETH
#undef DCMI
#undef CRYP
#undef HASH
#undef RNG
#undef FSMC_Bank1
#undef FSMC_Bank1E
#undef FSMC_Bank2
#undef FSMC_Bank3
#undef FSMC_Bank4
#undef DBGMCU


#endif /*_QB50_SYS_STM32F4XX_H*/

/*EoF*/
